"%@ Installer" = "%@ Instalare";
"By installing, you agree to the %@ and %@" = "Prin instalare, sunteți de acord cu %@ și %@";
"About %@" = "Despre %@";
"Hide %@" = "Ascunde %@";
"Hide Others" = "Ascunde Altele";
"Show All" = "Arată toate";
"Quit %@" = "Renunță %@";
"Window" = "Fereastră";
"Minimize" = "Minimalizează";
"Zoom" = "Zoom";
"Bring All to Front" = "Adu Toate în Față";
"Help" = "Ajutor";
"Support Center" = "Centru Suport";
"Privacy Policy" = "Politica de Confidențialitate";
"EULA" = "EULA";
"End User License Agreement" = "Acord de licență pentru utilizatorul final";
"Direct Download" = "Descarcă Direct";
"An error occurred during installation." = "A apărut o eroare în timpul instalării.";
"Please make sure you have Internet connection and try again." = "Asigurați-vă că aveți conexiune la Internet și încercați din nou.";
"Try Again" = "Încearcă din nou";
"Quit" = "Renunță";
"Launch" = "Inițializează";
"Install and Reopen" = "Instalează și redeschide";
"Installation still in progress" = "În curs de instalare";
"Are you sure you want to quit before the process is completed?" = "Eşti sigur că vrei să renunţi înainte de finalizarea procesului?";
"Cancel" = "Anulează";
"Version" = "Versiunea";
"Install" = "Instalează";
"Downloading" = "Se descarcă";
"Installing" = "Se instalează";
"Continue" = "Continuă";
"Product Page" = "Pagina de produs";
"Unable to install it to the application directory, please change the installation path." = "Imposibil de instalat în directorul aplicației, modificați calea de instalare.";
"OK" = "OK";
"The current macOS version is too old." = "Versiunea curentă de macOS este prea veche.";
"The current macOS version is too old to run the software. Please try to download system-supported version of the software and reinstall." = "Versiunea curentă de macOS este prea veche pentru a rula software-ul. Încercați să descărcați versiunea de software acceptată de sistem și să reinstalați.";
"Close" = "Închide";
"Copyright © 2020 %@. All rights reserved." = "Drepturi de autor © 2020 %@. Toate drepturile rezervate.";
"You've installed %@. Please reinstall or launch directly this software." = "Ați instalat %@. Reinstalați sau lansați direct acest software.";
"Please exit the %@ before reinstalling. If failed to launch, please go and find %@ in Applications." = "Ieșiți din %@ înainte de a reinstala. Dacă nu s-a reușit lansarea, mergeți și găsiți %@ în Aplicații.";
"Reinstall" = "Reinstalare";
"Your installer is running now. Please click to start it." = "Programul de instalare se execută acum. Faceți clic pentru a-l porni.";
